Headlinr_System2/Headlinr_System2/SoapCalls/requestId.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:tns="http://tempuri.org/">
	<soap:Body>
		<tns:GetById>
			<id>https://www.derstandard.at/story/3000000270805/dersparkurs-frisst-von-kleinen-einkommen-die-groessten-teile-weg?ref=rss</id>
		</tns:GetById>
	</soap:Body>
</soap:Envelope>